import numpy as np
import pandas as pd
import matplotlib as mpl

# 解决中文显示问题
mpl.rcParams['font.sans-serif'] = ['SimHei']  # 微软雅黑
mpl.rcParams['axes.unicode_minus'] = False  # 字符编码


# 信息熵
def entropy(p):
    # sum = 0.0
    # for i in p:
    #     if i!=0:
    #       sum +=  -i *np.log2(i)
    return np.sum([-i * np.log2(i) for i in p if i != 0])


def H(p):
    return entropy(p)


# 基尼系数
def gini(p):
    return 1 - np.sum(i * i for i in p)


# 错误率
def error(p):
    return 1 - np.max(p)


if __name__ == '__main__':
    """
    是否购房，婚姻撞库，年收入，是否目标类别
    是,单身,125,否
    否,已婚,100,否
    否,单身,100,否
    是,已婚,110,否
    是,离婚,60,否
    否,离婚,95,是
    否,单身,85,是
    否,已婚,75,否
    否,单身,90,是
    是,离婚,220,否
    """
    # 一、第一个选择节点的选择
    # 1.0 计算整个数据集的纯度（样本数量10的y列，3个是，7个否）
    h0 = H([0.7, 0.3])  # 0.8812908992306927

    # 1.1 计算以房产作为分割点的时候条件熵（遍历数据计算*1是和否的概率）
    # 第一个分支（是）：样本数目:4,全部为否
    p11 = 0.4
    h11 = H([1.0, 0])  # 0.0
    # 第二个分支（否）：样本数目：6,3个事，3个否
    p12 = 0.6
    h12 = H([0.5, 0.5])  # 1.0
    # H(D|A)
    h1 = p11 * h11 + p12 * h12  # 0.6
    # H(X,Y)-H(X)
    # print(H([0.4,0.3,0.3])-H([0.4,0.6]))
    # gain 信息增益度
    g1 = h0 - h1
    # todo:信息增益率
    g1_r = g1 / H([p11, p12])
    # print("以房产作为划分特征的时候，信息增度为：{}".format(g1))
    # print("以房产作为划分特征的时候，信息增益率为：{}".format(g1_r))
    """
    以房产作为划分特征的时候，信息增度为：0.2812908992306927
    以房产作为划分特征的时候，信息增益率为：0.2897067068470965
    """
    # 1.2计算以婚姻情况作为分割点的时候条件熵（遍历数据计算X2为单身、离异、已婚等概率）
    # 第一分支（单身）：样本数目：4,2个是，2个否
    p21 = 0.4
    h21 = H([0.5, 0.5])  # 1.0
    # 第二个分支（离婚）：样本数目：3,1个是，2个否
    p22 = 0.3
    h22 = H([1.0 / 3, 2.0 / 3])  # 0.9182958340544896
    # 第三个分支（已婚）：样本数据：3,3个否
    p23 = 0.3
    h23 = H([1.0, 0])  # 0.0
    h2 = p21 * h21 + p22 * h22 + p23 * h23  # 0.6754887502163469
    g2 = h0 - h2  # 0.2058021490143458
    g2_r = g2 / H([p21, p22, p23])  # 0.13100485129246656
    # print("以婚姻作为划分特征的时候，信息增度为：{}".format(g2))
    # print("以婚姻作为划分特征的时候，信息增益率为：{}".format(g2_r))
    """
    以婚姻作为划分特征的时候，信息增度为：0.2058021490143458
    以婚姻作为划分特征的时候，信息增益率为：0.13100485129246656
    """
    # 1.3以年收入80作为划分值
    # 第一分支：小于等于80，样本数目8,2个是，2个否
    p31 = 0.2
    h31 = H([1.0, 0])  # 0.0
    # 第二分支：大于80；样本数目：8,3个是，5个否
    p32 = 0.8
    h32 = H([3.0 / 8, 5.0 / 8])  # 0.954434002924965
    h3 = p31 * h31 + p32 * h32  # 0.7635472023399721
    g3 = h0 - h3
    g3_r = g3 / H([p31, p32])
    # print("以年收入80作为划分特征的时候，信息增度为：{}".format(g3))
    # print("以年收入80作为划分特征的时候，信息增益率为：{}".format(g3_r))
    """
    以年收入80作为划分特征的时候，信息增度为：0.11774369689072062
    以年收入80作为划分特征的时候，信息增益率为：0.16309615559301843
    """
    # 1.4以年收入97.5作为划分值
    # 第一分支：小于等于97.5，样本数目5,3个是，2个否
    p41 = 0.5
    h41 = H([2.0 / 5, 3.0 / 5])  # 0.9709505944546686
    # 第二分支：大于97.5；样本数目：5,5个否
    p42 = 0.5
    h42 = H([1.0, 0])  # 0.0
    h4 = p41 * h41 + p42 * h42  # 0.4854752972273343
    g4 = h0 - h4
    g4_r = g4 / H([p41, p42])
    # print("以年收入97.5作为划分特征的时候，信息增度为：{}".format(g4))
    # print("以年收入97.5作为划分特征的时候，信息增益率为：{}".format(g4_r))
    """
    以年收入97.5作为划分特征的时候，信息增度为：0.3958156020033584
    以年收入97.5作为划分特征的时候，信息增益率为：0.3958156020033584
    """
    print("=" * 100)
    # 二 针对于左子树继续划分（年收入小于97.5：样本数目：5,3个是，2个否）
    # H(D)
    h0 = h41

    # 2.1 计算以房产作为分割点的条件熵
    # 第一个分支：是，样本数目：1，全为否
    p11 = 0.2  # 1/5
    h11 = H([1.0, 0])  # 0.0
    # 第二个分支：否，样本数目：4，3个是，1个否
    p12 = 0.8
    h12 = H([0.75, 0.25])  # 0.8112781244591328
    h1 = p11 * h11 + p12 * h12  # 0.6490224995673063
    g1 = h0 - h1
    # print("以房产作为划分特征的时候，信息增度为：{}".format(g1))
    """
    以房产作为划分特征的时候，信息增度为：0.3219280948873623
    """
    # 2.2计算以婚姻情况作为分割点的时候条件熵（遍历数据计算X2为单身、离异、已婚等概率）
    # 第一分支：单身：样本数目：2,2个是
    p21 = 0.4
    h21 = H([1, 0])  # 0.0
    # 第二个分支：离婚：样本数目：2,1个是，2个否
    p22 = 0.4
    h22 = H([0.5, 0.5])  # 1.0
    # 第三个分支：已婚，样本数据：1,1个否
    p23 = 0.2
    h23 = H([1.0])  # 0.0
    h2 = p21 * h21 + p22 * h22 + p23 * h23  # 0.4
    g2 = h0 - h2
    # print("以婚姻作为划分特征的时候，信息增度为：{}".format(g2))
    """
    以婚姻作为划分特征的时候，信息增度为：0.5709505944546686
    """
    print("=" * 100)
